package HomeWork;

//First level: - Создайте две переменные isWeekend и isRain.
//Создайте переменную canWalk, значение которой должно быть истинным,
//если это выходной день (isWeekend=true) и не идет дождь (isRain=false).

public class WalkOrNoteWalr {
    public static void main(String[] args) {
        boolean isWeekend = true;
        boolean isRain = false;
        boolean canWalk;

        if (canWalk = isWeekend && !isRain) {

            System.out.println("Go walk? " + canWalk);
        }
    }
}
